README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-11 Wed 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&gt; org-html-dracula</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Rojas" />
<link rel="stylesheet" type="text/css" href="styles/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">
<span class="accent">></span> org-html-dracul<span class="inverse">a</span>
</h2>

<div class="abstract">
<p>
<a href="https://draculatheme.com/">Dracula theme</a> is my current default for code editing, gnome, terminal, etc. <a href="https://orgmode.org/">Org-mode</a> is a great tool for workflows involving text and code documents that I'm starting to love.
Hence I created this CSS stylesheet for Org HTML exports with Dracula colors!
</p>

</div>

<blockquote>
<p>
"My old recipes look so cool now!"<br />
&#x2013; Dracula
</p>
</blockquote>

<span id="end-heading"></span>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf14355d">1. Changelog</a>
<ul>
<li><a href="#org9a4e9fa">1.1. Initial Release</a></li>
</ul>
</li>
<li><a href="#org24c576f">2. Tasks <code>[0/3]</code> <code>[0%]</code></a></li>
<li><a href="#orgbd1159c">3. How to use</a>
<ul>
<li><a href="#org34865b1">3.1. Simple</a></li>
<li><a href="#org3e041c3">3.2. Customized</a></li>
</ul>
</li>
<li><a href="#org8750401">4. Ideas</a>
<ul>
<li><a href="#org9ba5353">4.1. Using Org for more things</a></li>
<li><a href="#org8e14d61">4.2. UI alternatives</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf14355d" class="outline-2">
<h2 id="orgf14355d"><span class="section-number-2">1</span> Changelog</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9a4e9fa" class="outline-3">
<h3 id="org9a4e9fa"><span class="section-number-3">1.1</span> Initial Release</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc1ef823" class="outline-4">
<h4 id="orgc1ef823">New tags</h4>
<div class="outline-text-4" id="text-orgc1ef823">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">message</th>
<th scope="col" class="org-left">git</th>
<th scope="col" class="org-left">links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">pre-release: test gh pages</td>
<td class="org-left">v0.1.0-0</td>
<td class="org-left"><a href="https://github.com/drojas/org-html-dracula">github.com</a></td>
</tr>

<tr>
<td class="org-left">release: first release</td>
<td class="org-left">v0.1.1</td>
<td class="org-left"><a href="https://github.com/drojas/org-html-dracula">github.com</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcf8cde8" class="outline-4">
<h4 id="orgcf8cde8">New features</h4>
<div class="outline-text-4" id="text-orgcf8cde8">
</div>
<ul class="org-ul">
<li><a id="orgd7b1f01"></a><span class="done DONE">DONE</span> Minimal stylesheet <code>[2/2]</code> <code>[100%]</code><br />
<div class="outline-text-5" id="text-orgd7b1f01">
<ul class="org-ul">
<li class="on"><code>[X]</code> include dracula theme colors</li>
<li class="on"><code>[X]</code> normalize.css <del>or alternative</del></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org24c576f" class="outline-2">
<h2 id="org24c576f"><span class="section-number-2">2</span> Tasks <code>[0/3]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Improve layout</li>
<li class="off"><code>[&#xa0;]</code> Reduce boilerplate</li>
<li class="off"><code>[&#xa0;]</code> Add support for tags</li>
</ul>
</div>
</div>

<div id="outline-container-orgbd1159c" class="outline-2">
<h2 id="orgbd1159c"><span class="section-number-2">3</span> How to use</h2>
<div class="outline-text-2" id="text-3">
<p>
This document was exported from <code>this</code> Org file. You can use the styles in any of the following manners
</p>
</div>

<div id="outline-container-org34865b1" class="outline-3">
<h3 id="org34865b1"><span class="section-number-3">3.1</span> Simple</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org407367d" class="outline-4">
<h4 id="org407367d">Stylesheet</h4>
<div class="outline-text-4" id="text-org407367d">
<p>
The CSS source is <code>here</code>
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #8995ba;">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="styles/org.css"/&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfbc571" class="outline-4">
<h4 id="orgcfbc571">Setup file</h4>
<div class="outline-text-4" id="text-orgcfbc571">
<p>
The setup file only adds a stylesheet but may include other features in the future
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #8995ba;">#+SETUPFILE: ./setup.org</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3e041c3" class="outline-3">
<h3 id="org3e041c3"><span class="section-number-3">3.2</span> Customized</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The following snippet can be copied and pasted to start a new document.
This is how the Org for of this document looks like.
</p>
</div>
<div id="outline-container-org6ae439d" class="outline-4">
<h4 id="org6ae439d">Org HTML boilerplate</h4>
<div class="outline-text-4" id="text-org6ae439d">
<div class="org-src-container">
<pre class="src src-org"><span style="color: #8995ba;">#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t title:nil</span>
<span style="color: #8995ba;">#+SETUPFILE: ./setup.org</span>

<span style="color: #6272a4;"># Document heading</span>

<span style="color: #6272a4; background-color: #23242f;">#+begin_export html</span>
<span style="color: #bd93f9; background-color: #23242f;">&lt;</span><span style="color: #50fa7b; background-color: #23242f;">div</span><span style="color: #bd93f9; background-color: #23242f;"> </span><span style="color: #f8f8f2; background-color: #23242f;">id</span><span style="color: #bd93f9; background-color: #23242f;">=</span><span style="color: #f1fa8c; background-color: #23242f;">"floating-logo"</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #bd93f9; background-color: #23242f;">  images here will be seen at the top with "space between"</span>
<span style="color: #bd93f9; background-color: #23242f;">&lt;/</span><span style="color: #50fa7b; background-color: #23242f;">div</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #6272a4; background-color: #23242f;">#+end_export</span>

<span style="color: #6272a4; background-color: #23242f;">#+BEGIN_export html</span>
<span style="color: #bd93f9; background-color: #23242f;">&lt;</span><span style="color: #50fa7b; background-color: #23242f;">h1</span><span style="color: #bd93f9; background-color: #23242f;"> </span><span style="color: #f8f8f2; background-color: #23242f;">class</span><span style="color: #bd93f9; background-color: #23242f;">=</span><span style="color: #f1fa8c; background-color: #23242f;">"title"</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #bd93f9; background-color: #23242f;">  &lt;</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;"> </span><span style="color: #f8f8f2; background-color: #23242f;">class</span><span style="color: #bd93f9; background-color: #23242f;">=</span><span style="color: #f1fa8c; background-color: #23242f;">"accent"</span><span style="color: #bd93f9; background-color: #23242f;">&gt;&gt;&lt;/</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;">&gt; org-html-dracul&lt;</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;"> </span><span style="color: #f8f8f2; background-color: #23242f;">class</span><span style="color: #bd93f9; background-color: #23242f;">="inverse"&gt;a&lt;/</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #bd93f9; background-color: #23242f;">&lt;/</span><span style="color: #50fa7b; background-color: #23242f;">h2</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #6272a4; background-color: #23242f;">#+END_export</span>

<span style="color: #6272a4; background-color: #23242f;">#+BEGIN_abstract</span>
This text will appear in italics after the title
<span style="color: #6272a4; background-color: #23242f;">#+END_abstract</span>

<span style="color: #6272a4; background-color: #23242f;">#+BEGIN_QUOTE</span>
Quote you favorite fictional characters here :)
<span style="color: #6272a4; background-color: #23242f;">#+END_QUOTE</span>

<span style="color: #6272a4; background-color: #23242f;">#+BEGIN_export html</span>
<span style="color: #bd93f9; background-color: #23242f;">&lt;</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;"> </span><span style="color: #f8f8f2; background-color: #23242f;">id</span><span style="color: #bd93f9; background-color: #23242f;">=</span><span style="color: #f1fa8c; background-color: #23242f;">"end-heading"</span><span style="color: #bd93f9; background-color: #23242f;">&gt;&lt;/</span><span style="color: #50fa7b; background-color: #23242f;">span</span><span style="color: #bd93f9; background-color: #23242f;">&gt;</span>
<span style="color: #6272a4; background-color: #23242f;">#+END_export</span>

<span style="color: #8995ba;">#+TOC: headlines 2</span>

<span style="color: #6272a4;"># continue with Org file content after this line</span>

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org8750401" class="outline-2">
<h2 id="org8750401"><span class="section-number-2">4</span> Ideas</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9ba5353" class="outline-3">
<h3 id="org9ba5353"><span class="section-number-3">4.1</span> Using Org for more things</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Automated changelog with Org and git</li>
</ul>
</div>
</div>
<div id="outline-container-org8e14d61" class="outline-3">
<h3 id="org8e14d61"><span class="section-number-3">4.2</span> UI alternatives</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Drawer/pusher navigation</li>
<li class="off"><code>[&#xa0;]</code> Custom exporter?</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Rojas</p>
<p class="date">Created: 2019-09-11 Wed 18:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
